cases/case2/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.0;          // Pressure drop (m/s)^2
    }

    outlet
    {
        type            fixedValue;
        value           uniform -6000.0;
    }

    walls
    {
        type            zeroGradient;
    }

    periodicx1
    {
        type            cyclic;
    }
    periodicx2
    {
        type            cyclic;
    }

}

// ************************************************************************* //
